import test, { describe } from 'node:test'
import { parseName } from '../../src/utils/parse'

describe('parseName', () => {
  const names: string[] = [
    '清水市代女流王将',
    '米長邦雄前名人',
    '中井広恵女流王位',
    '森 ケイ二九段',
    '大山康晴15世名人',
    '林葉直子女流名人',
    '中原誠前名人',
    '里見香奈女流名人・倉敷',
    '清水上徹アマ',
    '久保利明棋王・王将',
    '中川慧梧アマ',
    '清水市代女流二冠',
    '佐藤康光棋聖・棋王',
    '中原 誠永世十段・名誉王座',
    '中原 誠十六世名人',
    '羽生善治三冠',
    '谷川浩司王位棋王',
    '羽生善治王座',
    '佐藤康光銀河',
    '瀬川晶司前アマ王将',
    '瀬川晶司前アマ王将 (欠番)',
    '羽生善治王位王座',
    '佐藤康光棋聖王将',
    '米長邦雄永世棋聖',
    '甲斐智美女王・女流王位',
    '里見香奈女流名人倉敷藤花',
    '里見香奈女流王将',
    '甲斐智美女流王位倉敷藤花',
    '加藤桃子女王女流王座',
    '里見香奈女流名人女流王位',
    '香川愛生女流王将',
    '加藤桃子女王',
    '加藤桃子奨励会初段',
    '加藤桃子清麗'
  ]

  for (const name of names) {
    test(name, () => {
      console.log(parseName(name))
    })
  }
})
